src/cf/InformationRegisters/РекомендованныеНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РекомендованныеНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияНастроек</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючНазначенияИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СокращенноеИмяФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СокращенныйКлючНазначенияИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РекомендованныеНастройки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяФормыПриИзменении(Элемент)
	
	ИмяФормыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КлючНазначенияИспользованияПриИзменении(Элемент)
	
	КлючНазначенияИспользованияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИмяФормыПриИзмененииНаСервере()
	
	Запись.СокращенноеИмяФормы =
		РегистрыСведений.РекомендованныеНастройки.СокращенноеИмяФормы(Запись.ИмяФормы);
	
КонецПроцедуры

&НаСервере
Процедура КлючНазначенияИспользованияПриИзмененииНаСервере()
	
	Запись.СокращенныйКлючНазначенияИспользования =
		РегистрыСведений.РекомендованныеНастройки.СокращенныйКлючНазначенияИспользования(Запись.КлючНазначенияИспользования);
	
КонецПроцедуры

#КонецОбласти
